Revit 2026 API

# BuiltInFailuresDocumentFailures Class

---

Failures about DocumentFailures.

SystemObject Autodesk.Revit.DBBuiltInFailuresDocumentFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class DocumentFailures
```
```vb
Public NotInheritable Class DocumentFailures
```
```cpp
public ref class DocumentFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type DocumentFailures = class end
```

The BuiltInFailuresDocumentFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ApiDelayedUpdateFailed | Delayed Updating Failed. Please contact the 3rd Party Application vendor. |
|  | CannotAutoUpdate | Coordination Monitor can't update element |
|  | CannotLoadLink | Can't load Linked File [Name] due to errors. Open it separately to investigate the problem. |
|  | DUExcessiveRegeneration | Third party updater '[Name]' has caused an infinite loop and its action had to be canceled. |
|  | DUMisbehavingUpdater | Third party updater '[Name]' has experienced a problem and its action had to be canceled. |

#### Reference

Autodesk.Revit.DB Namespace